[
  {
    "name": "⌨️ Typractice",
    "description": [
      "While there are a lot of websites available around to practice your typing, I wanted to build my own which is free of any ads or tracking.",
      "It's a simple website which gives you a random paragraph to type. The timer keeps going until you enter the whole paragraph correctly. At the end you are presented your typing speed in terms of words-per-minute."
    ],
    "links": [
      {
        "text": "Website",
        "destination": "https://typractice.varunbarad.com"
      },
      {
        "text": "Source code",
        "destination": "https://github.com/VarunBarad/typractice"
      },
      {
        "text": "Release blog post",
        "destination": "/blog/project-typractice"
      }
    ]
  },
  {
    "name": "Pause",
    "description": [
      "A leave-management SaaS tool which I am building (of-course with a team) as my day-job at Obvious. I have worked as the backend-engineer of the project since its inception in August 2020."
    ],
    "links": [
      {
        "text": "Pause Website",
        "destination": "https://getpause.com"
      },
      {
        "text": "Obvious Website",
        "destination": "https://obvious.in"
      }
    ]
  },
  {
    "name": "DIY Git",
    "description": [
      "A tiny version of git made in Python which I built to learn the internals of git. I followed the awesome tutorial by Nikita to build this."
    ],
    "links": [
      {
        "text": "Source code",
        "destination": "https://github.com/VarunBarad/ugit"
      },
      {
        "text": "Tutorial by Nikita",
        "destination": "https://www.leshenko.net/p/ugit/"
      }
    ]
  },
  {
    "name": "Contacts Calendar",
    "description": [
      "A website which lets you export a calendar of important dates from your Google Contacts. I built this as a side-project to learn the basics of using Spring Boot framework."
    ],
    "links": [
      {
        "text": "Website",
        "destination": "https://contacts-calendar.varunbarad.com"
      },
      {
        "text": "Source code",
        "destination": "https://github.com/VarunBarad/contacts-calendar"
      },
      {
        "text": "Release blog post",
        "destination": "/blog/contacts-calendar"
      }
    ]
  },
  {
    "name": "⬢ Tiling Patterns Generator",
    "description": [
      "A program I made to generate wallpapers with tiling patterns on them.",
      "So far it supports hexagons, squares and a random voronoi pattern. I might add more in the future."
    ],
    "links": [
      {
        "text": "Source code",
        "destination": "https://github.com/VarunBarad/tiling-patterns"
      }
    ]
  },
  {
    "name": "🧑‍🎨 Voronoi Painter",
    "description": [
      "A Rust program I made to convert a painting or image into a similar-looking Voronoi diagram. Even with Rust I had to use multithreading to make it run in any reasonable span of time."
    ],
    "links": [
      {
        "text": "Source code",
        "destination": "https://github.com/VarunBarad/voronoi-painter"
      }
    ]
  },
  {
    "name": "🎨 Generative Art",
    "description": [
      "A website I made during my phase of learning about generative art. It's a collection of various generative art pieces I made using JavaScript.",
      "The favorite thing I learned while making this was how to have evenly distributed random points in a plane using Poisson Disc Sampling algorithm."
    ],
    "links": [
      {
        "text": "Website",
        "destination": "https://art.varunbarad.com/"
      },
      {
        "text": "Source code",
        "destination": "https://github.com/VarunBarad/generative-art"
      }
    ]
  },
  {
    "name": "Trust Invitation",
    "description": [
      "A website built so that I can have good conversation sparkers easily accessible at all times."
    ],
    "links": [
      {
        "text": "Website",
        "destination": "https://trust.varunbarad.com"
      },
      {
        "text": "Source code",
        "destination": "https://github.com/VarunBarad/trust-invitation"
      }
    ]
  },
  {
    "name": "Improvement Roll",
    "description": [
      "I built this website to learn about PWA basics and also so that it could suggest me useful things to do instead of infinitely scrolling the social media."
    ],
    "links": [
      {
        "text": "Website",
        "destination": "https://improvement-roll.varunbarad.com"
      },
      {
        "text": "Source code",
        "destination": "https://github.com/VarunBarad/improvement-roll"
      }
    ]
  },
  {
    "name": "My Places",
    "description": [
      "An application which helps me record locations which I want to save and keep track of."
    ],
    "links": [
      {
        "text": "Source code",
        "destination": "https://github.com/VarunBarad/my-places-android"
      }
    ]
  },
  {
    "name": "To-Read Manager",
    "description": [
      "I have built this app to let me manage my to-read links at one place on my phone. I can share tweets, webpages or anything else to the app and then later open it from there."
    ],
    "links": [
      {
        "text": "App on Play Store",
        "destination": "https://play.google.com/store/apps/details?id=com.varunbarad.toreadmanager"
      },
      {
        "text": "Source code",
        "destination": "https://github.com/VarunBarad/to-read-manager-android"
      }
    ]
  },
  {
    "name": "Clue Tracking Donut Clone",
    "description": [
      "I created a clone of Clue's cycle-tracking donut chart to learn/practice making performant custom-views in Android."
    ],
    "links": [
      {
        "text": "Source code",
        "destination": "https://github.com/VarunBarad/clue-tracking-donut-clone"
      }
    ]
  },
  {
    "name": "Attendance Tracker",
    "description": [
      "I made this as my Capstone Project for Udacity's Android Nanodegree. This was my chance to assimilate everything  I learned during the Nanodegree and make something useful with it. During college, we found it cumbersome to  track our attendance in various classes. That was the origin for this app. I made it so that there is a  streamlined way for students to keep track of their attendance."
    ],
    "links": [
      {
        "text": "App on Play Store",
        "destination": "https://play.google.com/store/apps/details?id=com.varunbarad.attendancetracker"
      },
      {
        "text": "Source code",
        "destination": "https://github.com/VarunBarad/Attendance-Tracker"
      }
    ]
  },
  {
    "name": "Udaan Android App",
    "description": [
      "Udaan is the annual tech-fest of BVM Engineering College. The Development Team of Udaan has seen to all the IT  related needs of the festival, including but no limited to making a companion website along with native apps for  both Android & Windows platforms. We have been doing it every year since 2015."
    ],
    "links": [
      {
        "text": "Source code",
        "destination": "https://github.com/bvmites/udaan17-android-app"
      }
    ]
  },
  {
    "name": "Udaan-16 SMS Web App",
    "description": [
      "This was a web-app made by Team Udaan for Udaan-16. Event managers could use this to send SMS to all their  participants, who had qualified for next round, about the time and location of next round. I was the one who  wired the UI created by my team-mates with the API using JavaScript."
    ],
    "links": [
      {
        "text": "Source code",
        "destination": "https://github.com/bvmites/udaan16-sms-web-app"
      }
    ]
  },
  {
    "name": "Pop Movies",
    "description": [
      "I made this project as part of my coursework for Udacity's Android Nanodegree. This taught me the use of REST APIs, loading images from network and local data persistence in an Android application."
    ],
    "links": [
      {
        "text": "Source code",
        "destination": "https://github.com/VarunBarad/PopularMovies"
      }
    ]
  },
  {
    "name": "Droid Bakery",
    "description": [
      "I made this project as part of my coursework for Udacity's Android Nanodegree. This taught me how to play videos on Android from network using a famous library named ExoPlayer."
    ],
    "links": [
      {
        "text": "Source code",
        "destination": "https://github.com/VarunBarad/BakingApp"
      }
    ]
  },
  {
    "name": "Crawded",
    "description": [
      "Worked a paid internship at Crawded which was an education startup focused on building a platform where students can interact with other students and teachers but the interaction remains related only to knowledge sharing. A vast number of features in the original SchoolWeb application were made by me, and I was responsible for developing the initial \"Feed\" in their main application.",
      "The company has since shut-down and there are no public links available to that work."
    ]
  },
  {
    "name": "DPTK Contacts",
    "description": [
      "A stockbroking and wealth management firm required an application which helped them to provide up-to-date contact information of each of their offices and employees both to their employees and their customers. So I made a desktop application using Kotlin which would parse data provided by them in Excel files and upload it to Firebase, from where it would be pulled down by the Android application for their use.",
      "Sadly this project never reached finishing point and was thus never published."
    ],
    "links": [
      {
        "text": "Source code (Android App)",
        "destination": "https://github.com/VarunBarad/dptk-contacts-app"
      },
      {
        "text": "Source code (Desktop Uploader)",
        "destination": "https://github.com/VarunBarad/dptk-contacts-uploader"
      }
    ]
  },
  {
    "name": "Wallpaper Changer",
    "description": [
      "I got bored with seeing the same wallpaper and Gnome (the DE I was using) didn't have any inbuilt feature to cycle between wallpapers. So I decided to use this opportunity to try and dip my hands in Kotlin.",
      "Though these days I am thinking of building versions of this in Rust that work on Mac and Windows. No reason other than just to get more experience with Rust and to have fun.",
      "Months after that last statement, I have found out that atleast Mac has a built-in feature to cycle wallpapers. So hooray, I get more time to work on some other project."
    ],
    "links": [
      {
        "text": "Source code",
        "destination": "https://github.com/VarunBarad/wallpaper-changer"
      }
    ]
  },
  {
    "name": "Digital Joker",
    "description": [
      "I made this project as part of my coursework for Udacity's Android Nanodegree. This taught me to use Gradle to create separate free and paid versions of an app, and including different features based on whether the app is free or paid. It also taught me how to separate an app into different modules for better code reuse."
    ],
    "links": [
      {
        "text": "Source code",
        "destination": "https://github.com/VarunBarad/Digital-Joker"
      }
    ]
  },
  {
    "name": "VegGKart",
    "description": [
      "A friend of mine was approached for making an Android application for an already existing grocery shopping site. He built an HTTP API and called me in to develop the Android app which uses that API."
    ],
    "links": [
      {
        "text": "Source code",
        "destination": "https://github.com/VarunBarad/veggkart"
      }
    ]
  }
]
